app/controllers/comments_controller.rb

SELECT  "articles".* FROM "articles" WHERE "articles"."id" = ? LIMIT ?  [["id", 4], ["LIMIT", 1]]
SELECT  "comments".* FROM "comments" WHERE "comments"."article_id" = ? ORDER BY "comments"."id" ASC LIMIT ?  [["article_id", 4], ["LIMIT", 1]]
---
  def index
    @article = Article.find(params[:article_id])
    @comment = @article.comments.all

SELECT  "articles".* FROM "articles" WHERE "articles"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
INSERT INTO "comments" ("commenter", "body", "article_id", "created_at", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?, ?)  [["commenter", "1"], ["body", "sdgsdgsdg"], ["article_id", 4], ["created_at", "2017-08-23 09:35:18.026613"], ["updated_at", "2017-08-23 09:35:18.026613"], ["user_id", 1]]
---
  def create
    @article = Article.find(params[:article_id])
    @comment = @article.comments.create(comment_params)